---
kind: type
id: T:Autodesk.Revit.DB.ParameterFilterElement
source: html/b231dc85-516a-5e75-c634-c6cd81b43fc5.htm
---
# Autodesk.Revit.DB.ParameterFilterElement

Admits elements that satisfy two conditions:
 The element's category must be one of a certain set of allowed categories. The element must pass a series of filter rules.

## Syntax (C#)
```csharp
public class ParameterFilterElement : FilterElement
```